Autodesk.Revit.DB.ExtensibleStorage.ContainerType
An enumerated type indicating if the field represents a single value or a container of multiple values.

Autodesk.Revit.DB.ExtensibleStorage.ContainerType.Map
An ordered map from keys to values

Autodesk.Revit.DB.ExtensibleStorage.ContainerType.Array
An expandable array of values

Autodesk.Revit.DB.ExtensibleStorage.ContainerType.Simple
One instance of the value included directly